{"Constat à L'Amiable": ["The Road Traffic Act has been amended whereby it is no longer mandatory for you to call the police to the spot of accident before moving the vehicles involved in an accident. You however have to fill-in a form called the 'Agreed Statement of Facts' in cases where there are no dispute. If there is dispute the form should not be filled and the accident must be reported to the nearest police station. If any of the vehicles does not have an 'Insurance Vignette' on the front windscreen then the form should not be filled."], 
"Claims": [
    "Here are some guidelines that we recommend our clients to follow in case their vehicle(s) is/are involved in a road accident where the AGREED STATEMENT OF FACTS form cannot be used:",
    "FOR ACCIDENTS WHICH FALL UNDER THE ROAD TRAFFIC (AMENDMENT No 3) ACT 2003 *-When two drivers agree on the circumstances of the accident, please read section two below.",
    "~- Do not move your vehicle from the spot unless ordered by the Police to do so.",
    "~- Put the hazard lights on and place the reflecting triangles at a reasonable distance from the rear of the vehicle.",
    "~- Do not leave the damaged vehicle unattended.",
    "~- Report the accident immediately to the nearest Police Station. (In case you cannot report the accident immediately you must do so within 4 hours).",
    "~- In case there is more than two vehicles involved in the accident or when there are casualties or where there is any doubt either on the circumstances or the procedure to be followed, Do not accept liability. You must immediately make an entry at the Police Station without relating the circumstances of the accident and seek legal assistance from us to give a statement and a full description of the occurrence at the Police.",
    "~- Record the following: Vehicles registration number and Makes, name of the drivers/owners involved, their addresses, their Telephone numbers. Names and addresses of independent witnesses.",
    "~- If there are casualties (fatal, serious or slight injuries) do not accept liability and telephone either:",
    "~- Mr Dhan Seewoodoyal Telephone Number 258-5681 or Mr Reza Jandoo 768-0946. During business hours our claims Department Telephone Nos 213-2432.",
    "~- Call in person immediately at our claims Department accompanied by the driver (in case the vehicle was being driven by someone else than you) bringing the driving licence of the driver, his National Identity card, the Police Form PF 96, the Insurance certificate and the Log book of the car (Horse Power card).",
    "2. For accidents which fall under the RTA (AMENDMENT No 3) ACT 2003.",
    "It is important to take the following into consideration when completing the AGREED STATEMENT OF FACTS form:-",
    "~(a) Give a very clear indication of the point of impact (3A and 3B on the form).",
    "~(b) Give a very clear description of the accident (5A and 5B on the form). Remember that the description of the accident by the driver of vehicle A must tally with the description as given by the driver of vehicle B.",
    "~(c) When drawing the Sketch Plan: Show the position, Point of impact, and Direction in which the vehicles were moving at the time of the accident (If there are any continuous or broken white lines, Please indicate the same clearly).",
    "~(d) Put the exact Date, Time, and Location of the accident under Attendant Circumstances on the form.",
    "~(e) Follow the instructions on the AGREED STATEMENT OF FACTS form to ascertain when the form cannot be used.",
    "~(f) Please note that it is an offence under the Act if you do not notify the accident to your insurer and if you do not forward the AGREED STATEMENT OF FACTS form to your insurer within 5 days from the date of the accident.",
    "~(g) Furthermore, it is important to note that we cannot entertain any claim if we do not receive a duly completed MOTOR ACCIDENT CLAIM FORM of GFA Insurance Ltd. The driver must call at the office accompanied by the Policyholder to produce his driving licence and National Identity Card to complete the MOTOR VEHICLE ACCIDENT REPORT FORM.",
    "~(h) Also, follow the guidelines as per the brochure. Or Telephone our Claims Department as above.",
    "NB: DO NOT FORGET WHEN YOU ARE DRIVING A VEHICLE TO HAVE THE INSURANCE VIGNETTE, YOUR DRIVING LICENCE, AN AGREED STATEMENT OF FACTS FORM, AN INDELIBLE YELLOW CHALK OR YELLOW INDELIBLE MARKER, AND ANY OTHER EQUIPMENT AS REQUIRED BY THE LAW."
    ]

}