{
    "20. Persons who became citizens on 12 March 1968": [
        "(1) Every person who, having been born in Mauritius, was on 11 March 1968 a citizen of the United Kingdom and Colonies became a citizen of Mauritius on 12 March 1968.",
        "(2) Every person who, on 11 March 1968, was a citizen of the United Kingdom and Colonies—",[
                "~(a) having become such a citizen under the British Nationality Act 1948,1 by virtue of his having been naturalised by the Governor of the former Colony of Mauritius as a British subject before that Act came into force; or",
                "~(b) having become such a citizen by virtue of his having been naturalised or registered by the Governor of the former Colony of Mauritius under that Act,","became a citizen of Mauritius on 12 March 1968."],
                "~(3) Every person who, having been born outside Mauritius, was on 11 March 1968 a citizen of the United Kingdom and Colonies, if either of his parents became, or would but for his death have become, a citizen of Mauritius by virtue of subsection (1) or subsection (2), became a citizen of Mauritius on 12 March 1968.",
                "~(4) For the purposes of this section, a person shall be regarded as having been born in Mauritius if he was born in the territories which were comprised in the former Colony of Mauritius immediately before 8 November 1965 but were not so comprised immediately before 12 March 1968 unless either of his parents was born in the territories which were comprised in the Colony of Seychelles immediately before 8 November 1965."
            ],
    
    "21. Persons entitled to be registered as citizens":[
        "(1) Any person who, on 12 March 1968, was or had been married to another person—",[
            "~(a) who became a citizen of Mauritius by virtue of section 20; or",
            "~(b) who, having died before 12 March 1968 would, but for his death, have become a citizen of Mauritius by virtue of section 20,",
            "shall be entitled, upon making application and, if he is a British protected person or an alien, upon taking the oath of allegiance, to be registered as a citizen of Mauritius:"],
            "Provided that, in the case of any person who, on 12 March 1968, was not a citizen of the United Kingdom and Colonies, the right to be registered as a citizen of Mauritius under this section shall be subject to such exceptions or qualifications as may be prescribed in the interest of national security or public policy.",
            "(2) Any application for registration under this section shall be made in such manner as may be prescribed as respects that application. ",
            "=[S. 20 amended by Act 23 of 1995.]"],

    "22. Persons born in Mauritius after 11 March 1968":[
        "Every person born in Mauritius after 11 March 1968 shall become a citizen of Mauritius at the date of his birth: Provided that a person shall not become a citizen of Mauritius by virtue of this section if at the time of his birth—",[
            "~(a) neither of his parents is a citizen of Mauritius; or",
            "~(b) either of his parents is an enemy alien and the birth occurs in a place then under occupation by the enemy.",
            "=[S. 20 amended by Act 23 of 1995.]"]],

    "23. Persons born outside Mauritius after 11 March 1968":[
        "A person born outside Mauritius after 11 March 1968 shall become a citizen of Mauritius at the date of his birth if at that date either of his parents is a citizen of Mauritius otherwise than by virtue of this section or section 20 (3).",
        "=[S. 20 amended by Act 23 of 1995.]"],

    "24. Marriage to a citizen of Mauritius":[
        "Any person who, after 11 March 1968, marries another person who is or becomes a citizen of Mauritius shall be entitled, upon making application in such manner as may be prescribed and, if he is a British protected person or an alien, upon taking the oath of allegiance, to be registered as a citizen of Mauritius: Provided that the right to be registered as a citizen of Mauritius under this section shall be subject to such exceptions or qualifications as may be prescribed in the interests of national security or public policy. ",
        "=[S. 20 amended by Act 23 of 1995.]"],

    "25. Commonwealth citizens":[
            "(1) Every person who under this Constitution or any other law is a citizen of Mauritius or under any enactment for the time being in force in any country to which this section applies is a citizen of that country shall, by virtue of that citizenship, have the status of a Commonwealth citizen.",
            "(2) Every person who is a British subject without citizenship under the British Nationality Act 19482, or continues to be a British subject under section 2 of that Act or is a British subject under the British Nationality Act 19653 shall, by virtue of that status, have the status of a Commonwealth citizen.",
            "(3) Except as may be otherwise provided by regulations made by the Prime Minister, the countries to which this section applies are Antigua and Barbuda, Australia, Bahamas, Bangladesh, Barbados, Belize, Botswana, Brunei, Canada, Cyprus, Dominica, The Gambia, Ghana, Grenada, Guyana, India, Jamaica, Kenya, Kiribati, Lesotho, Malawi, Malaysia, Maldives, Malta, Namibia, Nauru, New Zealand, Nigeria, Pakistan, Papua New Guinea, St.Christopher-Nevis, St Lucia, St Vincent, Seychelles, Sierra Leone, Singapore, Solomon Islands, Sri Lanka, Swaziland, Tanzania, Tonga, Trinidad and Tobago, Tuvalu, Uganda, United Kingdom and Colonies, Vanuatu, Western Samoa and Zambia.",
            "=[S. 25 amended by Act 48 of 1991.]"
        ]


}