{
  "28. The President": [
    "(1) There shall be a President who shall—",
    "~(a) be the Head of State and Commander-in-Chief of the Republic of Mauritius;",
    "~(b) uphold and defend the Constitution and ensure that—",
    "~~(i) the institutions of democracy and the rule of law are protected;",
    "~~(ii) the fundamental rights of all are respected; and",
    "~~(iii) the unity of the diverse Mauritian nation is maintained and strengthened.",
    "(1A) Subject to section 64, the President shall, in the exercise of his functions under this Constitution or any other law, act in accordance with the principles set out in subsection (1) (b).",
    "(2)",
    "~(a) The President shall—",
    "~~(i) be elected by the Assembly on a motion made by the Prime Minister and supported by the votes of a majority of all the members of the Assembly; and",
    "~~(ii) subject to this section and section 30, hold office for a term of 5 years and shall be eligible for re-election.",
    "(b) A motion under paragraph (a) shall not be the subject matter of a debate in the Assembly.",
    "(3) No person shall be eligible for election to the office of President unless he is a citizen of Mauritius who is not less than 40 years of age and has resided in Mauritius for a period of not less than 5 years immediately preceding the election.",
    "(4) Where a person is elected to the office of President, he shall not, whilst in office—",
    "~(a) hold any other office of emolument, whether under the Constitution or otherwise;",
    "~(b) exercise any profession or calling or engage in any trade or business.",
    "(5) The President shall, at the expiry of his term, continue to hold office until another person assumes office as President.",
    "(6) The office of the President shall become vacant—",
    "~(a) subject to subsection (5), at the expiry of his term of office;",
    "~(b) where he dies or resigns his office by writing addressed to the Assembly and delivered to the Speaker; or",
    "~(c) where he is removed or suspended from office under section 30.",
    "(7) Where the office of President is vacant or the President is absent from Mauritius or is for any other reason unable to perform the functions of his office, those functions shall be performed—",
    "~(a) by the Vice-President; or",
    "~(b) where there is no Vice-President—",
    "~~(i) elected under section 29 (2) or (7); and",
    "~~(ii) able to perform the functions of the office of President, by the Chief Justice.",
    "(8) The person performing the functions of President under subsection (7) shall cease to perform those functions as soon as—",
    "~(a) another person is elected as President or the President resumes his office, as the case may be; or",
    "~(b) in the case of the Chief Justice, a Vice-President is elected under section 29 (2) or (7) and assumes office or the Vice-President resumes his office, as the case may be.",
    "=[S. 28 amended by Act 48 of 1991; s. 2 of Act 28 of 2003 w.e.f. 15 September 2003.]"
  ],

  "29. The Vice-President": [
    "(1) Subject to subsection (7), there shall be a Vice-President of the Republic of Mauritius.",
    "(2) The Vice-President shall—",
    "~(a) be elected in the manner specified in section 28 (2) (a) (i) and, subject to this section and section 30, hold office for a term of 5 years and be eligible for re-election;",
    "~(b) perform such functions as may be assigned to him by the President.",
    "(3) No person shall be eligible for election to the office of Vice-President unless he satisfies the conditions specified in section 28 (3).",
    "(4) Where a person is elected to the office of Vice-President, he shall not, whilst in office—",
    "~(a) hold any other office of emolument, whether under the Constitution or otherwise;",
    "~(b) exercise any profession or calling or engage in any trade or business.",
    "(5) The Vice-President shall, at the expiry of his term, continue to hold office until another person assumes office as Vice-President.",
    "(6) The office of the Vice-President shall become vacant—",
    "~(a) subject to subsection (5), at the expiry of his term of office;",
    "~(b) where he dies or resigns his office by writing addressed to the Assembly and delivered to the Speaker; or",
    "~(c) where he is removed or suspended from office under section 30.",
    "(7)",
    "~(a) Where the office of Vice-President is vacant, or the Vice-President is absent from Mauritius or is for any other reason unable to perform the functions of his office, those functions may be performed by such person as may be elected by the Assembly in the manner specified in section 28 (2) (a) (i).",
    "~(b) No person may be elected under paragraph (a) unless he satisfies the conditions specified in section 28 (3).",
    "(8) The person performing the functions of Vice-President under subsection (7) shall cease to perform those functions as soon as another person is elected and assumes office as Vice-President or the Vice-President resumes his office, as the case may be.",
    "=[S. 29 amended by Act 48 of 1991.]"
  ],

  "30. Removal of President and Vice-President": [
    "(1) The President or the Vice-President may be removed from office in accordance with this section for—",
    "~(a) violation of the Constitution or any other serious act of misconduct;",
    "~(b) inability to perform his functions whether arising from infirmity of mind or body or from any other cause.",
    "(2) Where the President fails to comply with section 46 (2), he may be removed from office on a motion made by the Prime Minister in the Assembly and supported by the votes of a majority of all the members of the Assembly.",
    "(3) The President or the Vice-President shall not be removed from office for any other cause unless—",
    "~(a) a motion that the circumstances requiring the removal of the President or the Vice-President be investigated by a tribunal is made in the Assembly by the Prime Minister;",
    "~(b) the motion states with full particulars the ground on which the removal of the President or the Vice-President is sought;",
    "~(c) the motion is supported by the votes of not less than two thirds of all the members of the Assembly;",
    "~(d) the tribunal, after its investigation, forwards a written report on the investigation addressed to the Assembly and delivered to the Speaker and recommends the removal of the President or the Vice-President; and",
    "~(e) subject to paragraph (f), a motion made by the Prime Minister and supported by the votes of a majority of all the members of the Assembly requires the removal of the President or the Vice-President on a recommendation to that effect by the tribunal;",
    "~(f) a motion under paragraph (e) is made—",
    "~~(i) where the Assembly is sitting, within 20 days of the receipt of the report of the tribunal by the Speaker;",
    "~~(ii) where the Assembly is not sitting, within 20 days of the day on which the Assembly resumes its sitting.",
    "(4) The President or the Vice-President shall have the right to appear and to be represented before the tribunal during its investigation.",
    "(5) Where the Assembly supports a motion under subsection (3) (c), it may suspend the President or the Vice-President from performing the functions of his office.",
    "(6) A suspension under subsection (5) shall cease to have effect where—",
    "~(a) a report under subsection (3) (d) does not recommend that the President or the Vice-President ought to be removed from office; or",
    "~(b) the Assembly does not support a motion under subsection (3) (e) requiring the removal of the President or the Vice-President.",
    "(7) Where the Assembly supports a motion under subsection (3) (e) requiring the removal of the President or the Vice-President, the office of the President or the Vice-President, as the case may be, shall become vacant.",
    "(8) In this section, “tribunal” means a tribunal consisting of a Chairperson and 2 or 4 other members appointed by the Chief Justice from amongst persons who hold or have held office as a Judge of a Court having unlimited jurisdiction in civil or criminal matters in some part of the Commonwealth or a Court having jurisdiction in appeals from such a Court.",
    "=[S. 29 amended by Act 48 of 1991.]"
  ],

  "30A. Privileges and immunities": [
    "(1) Subject to section 64 (5), no civil or criminal proceedings shall lie against the President or the Vice-President in respect of the performance by him of the functions of his office or in respect of any act done or purported to be done by him in the performance of those functions.",
    "(2) Subject to section 64 (5), no process, warrant or summons shall be issued or executed against the President or the Vice-President during his term of office.",
    "(3) The President or the Vice-President shall be entitled—",
    "~(a) without payment of any rent or tax, to the use of his official residence; and",
    "~(b) to such emoluments, allowances and privileges, exempt from any tax thereon, as may be prescribed.",
    "(4) No alteration to any of the entitlements specified in subsection (3) which is to the disadvantage of the President or the Vice-President shall have effect without his consent.",
    "=[S. 30A inserted by Act 48 1991.]"
  ],

  "30B. Oaths to be taken by President and Vice-President": [
    "(1) A person elected to the office of President or Vice-President or who assumes the functions of any of those offices shall, before assuming his functions, take and subscribe the appropriate oath set out in the Third Schedule.",
    "(2) An oath under this section shall be administered by the Chief Justice.",
    "=[S. 30B inserted by Act 48 1991.]"
  ]
}
