{
  "45. Power to make laws": [
    "(1) Subject to this Constitution, Parliament may make laws for the peace, order and good government of Mauritius.",
    "(2) Without prejudice to subsection (1), Parliament may by law determine the privileges, immunities and powers of the Assembly and its members."
  ],

  "46. Mode of exercise of legislative power": [
    "(1) The power of Parliament to make laws shall be exercisable by Bills passed by the Assembly and assented to by the President.",
    "(2)",
    "~(a) Subject to paragraphs (b) and (c), where a Bill is submitted to the President for assent in accordance with this Constitution, he shall signify that he assents or that he withholds assent.",
    "~(b) The President shall not withhold assent under paragraph (a)—",
    "~~(i) in the case of a Bill which makes provision for any of the purposes specified in section 54;",
    "~~(ii) in the case of a Bill which amends any provision of the Constitution and which is certified by the Speaker as having complied with the requirements of section 47;",
    "~~(iii) in the case of any other Bill, unless he is of opinion, acting in his own deliberate judgment, that the Bill, including any proposed amendment thereto, should be reconsidered by the Assembly.",
    "~(c) Where the President withholds assent under paragraph (b) (iii), he shall, within 21 days of the submission of the Bill for assent, return the Bill to the Assembly with a request that it should reconsider the Bill, including any proposed amendment thereto.",
    "~(d) Where a Bill is returned to the Assembly under paragraph (c), the Assembly shall reconsider the Bill accordingly, and where it is passed again by the Assembly with or without amendment and submitted anew to the President for assent, the President shall signify his assent.",
    "(3) Where the President assents to a Bill that has been submitted to him in accordance with this Constitution, the Bill shall become law and the President shall thereupon cause it to be published in the Gazette as a law.",
    "(4) No law made by Parliament shall come into operation until it has been published in the Gazette but Parliament may postpone the coming into operation of any such law and may make laws with retrospective effect.",
    "(5) All laws made by Parliament shall be styled “Acts of Parliament” and the words of enactment shall be “Enacted by the Parliament of Mauritius”."
  ],

  "47. Alteration of Constitution": [
    "(1) Subject to this section, Parliament may alter this Constitution.",
    "(2) A Bill for an Act of Parliament to alter any of the following provisions of this Constitution—",
    "~(a) this section;",
    "~(b) sections 28 to 31, 37 to 46, 56 to 58 other than 57 (2), 64, 65, 71, 72 and 108;",
    "~(c) Chapters II, VII, VIII and IX;",
    "~(d) the First Schedule; and",
    "~(e) Chapter XI, to the extent that it relates to any of the provisions specified in paragraphs (a) to (d),",
    "shall not be passed by the Assembly unless it is supported at the final voting in the Assembly by the votes of not less than three quarters of all the members of the Assembly.",
    "(3) A Bill for an Act of Parliament to alter the provisions of section 1 or 57 (2) shall not be passed by the Assembly unless—",
    "~(a) the proposed Bill has before its introduction in the Assembly been submitted, by referendum, to the electorate of Mauritius and has been approved by the votes of not less than three quarters of the electorate;",
    "~(b) it is supported at the final voting in the Assembly by the votes of all the members of the Assembly.",
    "(4) A Bill for an Act of Parliament to alter any provision of this Constitution (but which does not alter any of the provisions of this Constitution as specified in subsection (2)) shall not be passed by the Assembly unless it is supported at the final voting in the Assembly by the votes of not less than two thirds of all the members of the Assembly.",
    "(5) In this section, references to altering this Constitution or any part of this Constitution include references to—",
    "~(a) revoking it, with or without re-enactment or the making of different provision;",
    "~(b) modifying it, whether by omitting or amending any of its provisions or inserting additional provisions in it or otherwise; and",
    "~(c) suspending its operation for any period, or terminating any such suspension."
  ],

  "48. Regulation of procedure in National Assembly": [
    "Subject to this Constitution, the Assembly may regulate its own procedure and may, in particular, make rules for the orderly conduct of its own proceedings.",
    "=[S. 48 amended by Act 48 of 1991.]"
  ],

  "49. Official language": [
    "The official language of the Assembly shall be English but any member may address the chair in French."
  ],

  "50. Presiding in National Assembly": [
    "The Speaker or in his absence the Deputy Speaker, or in their absence a member of the Assembly (not being a Minister) elected by the Assembly for the sitting, shall preside at any sitting of the Assembly.",
    "=[S. 50 amended by Act 2 of 1982; Act 48 of 1991.]"
  ],

  "51. National Assembly may transact business notwithstanding vacancies": [
    "The Assembly may act, notwithstanding any vacancy in its membership, (including any vacancy not filled when the Assembly first meets after any general election) and the presence or participation of any person not entitled to be present at, or to participate in, the proceedings of the Assembly shall not invalidate those proceedings.",
    "=[S. 51 amended by Act 2 of 1982; Act 48 of 1991.]"
  ],

  "52. Quorum": [
    "(1) Where at any sitting of the Assembly a quorum is not present and any member of the Assembly who is present objects on that account to the transaction of business and, after such interval as may be prescribed by the Assembly, the person presiding at the sitting ascertains that a quorum is still not present, he shall adjourn the Assembly.",
    "(2) For the purposes of this section, a quorum shall consist of 17 members of the Assembly in addition to the person presiding."
  ],

  "53. Voting": [
    "(1) Except as otherwise provided in this Constitution, all questions proposed for decision in the Assembly shall be determined by a majority of the votes of the members present and voting; and a member of the Assembly shall not be precluded from so voting by reason only that he holds the office of Speaker or Deputy Speaker or is presiding in the Assembly.",
    "(2) Where, upon any question before the Assembly that falls to be determined by a majority of the members present and voting, the votes cast are equally divided, the Speaker, whether he is a member of the Assembly or not, or any other person presiding, shall have and shall exercise a casting vote.",
    "=[S. 53 amended by Act 1 of 1996.]"
  ],

  "54. Bills, motions and petitions": [
    "Except upon the recommendation of a Minister, the Assembly shall not—",
    "(a) proceed upon any Bill (including any amendment to a Bill) that, in the opinion of the person presiding, makes provision for any of the following purposes—",
    "~(i) for the imposition of taxation or the alteration of taxation otherwise than by reduction;",
    "~(ii) for the imposition of any charge upon the Consolidated Fund or other public funds of Mauritius or the alteration of any such charge otherwise than by reduction;",
    "~(iii) for the payment, issue or withdrawal from the Consolidated Fund or other public funds of Mauritius of any money not charged on it or any increase in the amount of such payment, issue or withdrawal; or",
    "~(iv) for the composition or remission of any debt to the Government;",
    "(b) proceed upon any motion (including any amendment to a motion) the effect of which, in the opinion of the person presiding, would be to make provision for any of those purposes; or",
    "(c) receive any petition that, in the opinion of the person presiding, requests that provision be made for any of those purposes."
  ],

  "55. Oath of allegiance": [
    "(1) No member of the Assembly shall take part in the proceedings of the Assembly (other than proceedings necessary for the purposes of this section) until he has taken and subscribed before the Assembly the oath of allegiance prescribed in the Third Schedule.",
    "(2) Where a person other than a member of the Assembly is elected as Speaker, he shall not preside at any sitting of the Assembly unless he has taken and subscribed before the Assembly the oath of allegiance prescribed in the Third Schedule.",
    "[S. 55 amended by Act 1 of 1996.]"
  ]
}
