{
    "85. Judicial and Legal Service Commission": [
        "(1) There shall be a Judicial and Legal Service Commission which shall consist of the Chief Justice, who shall be Chairperson, and the following members—",
        "~(a) the Senior Puisne Judge;",
        "~(b) the Chairperson of the Public Service Commission; and",
        "~(c) one other member (in this section referred to as “the appointed member”) appointed by the President, acting in accordance with the advice of the Chief Justice.",
        "(2) The appointed member shall be a person who is or has been a Judge of a Court having unlimited jurisdiction in civil or criminal matters in some part of the Commonwealth or a Court having jurisdiction in appeals from any such Court.",
        "(3) Where the office of the appointed member is vacant or the appointed member is for any reason unable to perform the functions of his office, the President, acting in accordance with the advice of the Chief Justice, may appoint a person qualified for appointment as such a member to act as a member of the Commission and any person so appointed shall continue to act until his appointment is revoked by the President, acting in accordance with the advice of the Chief Justice.",
        "[S. 85 amended by Act 48 of 1991.]"
    ],

    "86. Appointment of judicial and legal officers": [
        "(1) Power to appoint persons to hold or act in offices to which this section applies (including power to confirm appointments), to exercise disciplinary control over persons holding or acting in such offices and to remove such persons from office shall vest in the Judicial and Legal Service Commission.",
        "(2) The offices to which this section applies are the offices specified in the Second Schedule and such other offices as may be prescribed:",
        "Provided that—",
        "~(a) where the name of any such office is changed, or any such office is abolished, this section and that Schedule shall have effect accordingly;",
        "~(b) this section shall also apply to such other offices, being offices that in the opinion of the Judicial and Legal Service Commission are offices similar to those specified in the Second Schedule, as may be prescribed by the Commission, acting with the concurrence of the Prime Minister."
    ],

    "87. Appointments of principal representatives of Mauritius abroad": [
        "The power to appoint persons to hold the offices of Ambassador, High Commissioner or other principal representative of Mauritius in any other country or accredited to any international organisation and to remove such persons from office shall vest in the President, acting in accordance with the advice of the Prime Minister:",
        "Provided that, before advising the President to appoint to any such office a person who holds or is acting in some other public office, the Prime Minister shall consult the Public Service Commission."
    ],

    "88. Public Service Commission": [
        "(1) There shall be a Public Service Commission, which shall consist of a Chairperson, 2 Deputy Chairpersons, and 4 other Commissioners appointed by the President.",
        "(2) No person shall be qualified for appointment as a Commissioner of the Public Service Commission if he is a member of, or a candidate for election to, the Assembly or any local authority, a public officer, or a local government officer.",
        "(3) Where the office of Chairperson of the Public Service Commission is vacant or the Chairperson is for any reason unable to perform the functions of his office, those functions shall be performed by such one of the Deputy Chairpersons or Commissioners of the Commission as the President may appoint.",
        "(4) Where at any time there are less than 3 Commissioners of the Public Service Commission besides the Chairperson or where any such Commissioner is acting as Chairperson or is for any reason unable to perform the functions of his office, the President may appoint a person qualified for appointment as a Commissioner of the Commission to act as a Commissioner, and any person so appointed shall continue to act until his appointment is revoked by the President.",
        "(5) The functions of the President under this section shall be exercised by him after consultation with the Prime Minister and the Leader of the Opposition."
    ],

    "89. Appointment of public officers": [
        "(1) Subject to this Constitution, power to appoint persons to hold or act in any offices in the public service (including power to confirm appointments), to exercise disciplinary control over persons holding or acting in such offices and to remove such persons from office shall vest in the Public Service Commission.",
        "(2) (a) The Public Service Commission may, subject to such conditions as it thinks fit, delegate any of its powers under this section by directions in writing to any Commissioner of the Commission or to any public officer.",
        "(b) The Public Service Commission may, subject to such conditions as it may prescribe, delegate, by directions in writing, its powers under this section to inquire and report to it—",
        "  ~(i) in the case of any professional misconduct or negligence committed by a public officer in the performance of his duties, to any appropriate statutory disciplinary body;",
        "  ~(ii) in the case of a public officer who has been seconded for duty or transferred to a body corporate established by law for public purposes, to that body corporate.",
        "(3) This section shall not apply—",
        "  ~(a) to the office of Chief Justice or Senior Puisne Judge;",
        "  ~(b) except for the purpose of making appointments thereto or to act therein, to the office of Director of Audit;",
        "  ~(c) to the office of Ombudsman;",
        "  ~(d) to any office, appointments to which are within the functions of the Judicial and Legal Service Commission or the Disciplined Forces Service Commission;",
        "  ~(e) to any office to which section 87 applies;",
        "  ~(f) to any ecclesiastical office;",
        "  ~(g) —",
        "  ~(h) to any office of a temporary nature, the duties attaching to which are mainly advisory and which is to be filled by a person serving under a contract on non-pensionable terms.",
        "(4) Before any appointment is made to the office of Secretary to the Cabinet, of Financial Secretary, of a Permanent Secretary or of any other supervising officer within the meaning of section 68, the Public Service Commission shall consult the Prime Minister and no appointment to the office of Secretary to the Cabinet, of Financial Secretary or of a Permanent Secretary shall be made unless the Prime Minister concurs in it.",
        "(5) Notwithstanding subsections (1) to (4), the power to transfer any person holding any such office as is mentioned in subsection (4) to any other such office, being an office carrying the same emoluments, shall vest in the President, acting in accordance with the advice of the Prime Minister.",
        "(6) Before the Public Service Commission appoints to or to act in any public office any person holding or acting in any office the power to make appointments to which is vested in the Judicial and Legal Service Commission or the Disciplined Forces Service Commission, the Public Service Commission shall consult that Commission.",
        "(7) Before making any appointment to any office on the staff of the Ombudsman, the Public Service Commission shall consult the Ombudsman.",
        "(8) The Public Service Commission shall not exercise any of its powers in relation to any office on the personal staff of the President, or in relation to any person holding or acting in any such office, without the concurrence of the President, acting in his own deliberate judgment.",
        "(9) References in this section to the office of Financial Secretary or of a Permanent Secretary are references to that office as established on 11 March 1968 and include references to any similar office established after that date that carries the same or higher emoluments."
    ],

    "90. Disciplined Forces Service Commission": [
        "(1) There shall be for Mauritius a Disciplined Forces Service Commission which shall consist of the Chairperson of the Public Service Commission as Chairperson and 4 Commissioners who shall be appointed by the President.",
        "(2) No person shall be qualified for appointment as a Commissioner of the Disciplined Forces Service Commission where he is a member of or a candidate for election to, the Assembly or any local authority, a public officer or a local government officer.",
        "(3) Where at any time there are less than 2 Commissioners of the Disciplined Forces Service Commission besides the Chairperson or where any such Commissioner is for any reason unable to perform the functions of his office, the President may appoint a person who is qualified for appointment as a Commissioner of the Commission to act as a Commissioner, and any person so appointed shall continue to act until his appointment to act is revoked by the President.",
        "(4) The functions of the President under this section shall be exercised by him after consultation with the Prime Minister and the Leader of the Opposition."
    ],

    "91. Appointment in Disciplined Forces": [
        "(1) Subject to section 93, power to appoint persons to hold or act in any office in the disciplined forces (including power to confirm appointments), to exercise disciplinary control over persons holding or acting in such offices and to remove such persons from office shall vest in the Disciplined Forces Service Commission.",
        "Provided that appointments to the office of Commissioner of Police shall be made after consultation with the Prime Minister.",
        "(2) The Disciplined Forces Service Commission may, subject to such conditions as it thinks fit, by directions in writing delegate any of its powers of discipline or removal from office to the Commissioner of Police or to any other officer of the Disciplined Forces, but no person shall be removed from office except with the confirmation of the Commission."
    ],

    "91A. Public Bodies Appeal Tribunal": [
        "(1) There shall be a Public Bodies Appeal Tribunal which shall, notwithstanding section 119 but subject to subsection (3), have jurisdiction to hear and determine appeals made by public officers against such final decisions of such Commission established under this Constitution, as may be prescribed, or of any Commissioner or other person exercising powers delegated by that Commission.",
        "(2) The Public Bodies Appeal Tribunal may also hear and determine appeals made against final decisions of such other public bodies as may be prescribed.",
        "(3) No appeal shall lie to the Public Bodies Appeal Tribunal from any decision taken by a Commission prescribed under subsection (1) or by a public body prescribed under subsection (2), where the decision has been taken after consultation with, or with the concurrence of, or on the advice of, the Prime Minister.",
        "(4) The Public Bodies Appeal Tribunal shall consist of— (a) a Chairperson who is a barrister of not less than 10 years’ standing; (b) 2 other members who hold such qualifications as may be prescribed.",
        "(5) (a) The members of the Public Bodies Appeal Tribunal shall be appointed by the President after consultation with the Prime Minister and the Leader of the Opposition.",
        "(b) Where any of the 3 members of the Public Bodies Appeal Tribunal is unable to take part in the proceedings of the Tribunal on account of a direct interest in any appeal before the Tribunal, or of any other reason, another member shall be appointed, on an ad hoc basis, in the manner provided for under paragraph (a), to replace that member in the appeal.",
        "(6) No person shall be appointed under subsection (5) where— (a) he is a member of the Assembly or a local authority; (b) he is an office bearer of a political party or other political organisation; (c) at any time during the 10 years preceding such proposed appointment, he was engaged in politics; (d) he is a public officer, a local government officer or an employee of a statutory body; or (e) he is a person who receives, or is entitled to receive, fees or allowances specified in section 112 (3).",
        "(7) A member of the Public Bodies Appeal Tribunal shall cease to hold office as such where any circumstances arise that, if he did not hold that office, would cause him to be disqualified for appointment.",
        "(8) Where an appointment lapses or is terminated under subsection (7), no compensation shall become payable to the holder for loss of office by reason of the lapse or termination of his appointment.",
        "(9) Notwithstanding any other provision of the Constitution— (a) proceedings before the Public Bodies Appeal Tribunal shall not be held in public, except where the Tribunal decides otherwise with the agreement of the parties to an appeal; (b) the Public Bodies Appeal Tribunal shall not be bound to communicate to any other person the contents of any report, document or other material produced by any Commission or public body and, except where necessary for the purpose of making its decision, the Tribunal shall make no reference to the contents thereof in its decision.",
        "(10) A member of the Public Bodies Appeal Tribunal shall hold office for such term and on such conditions as may be determined by the President.",
        "(11) A member of the Public Bodies Appeal Tribunal may be removed from office only for inability to discharge the functions of his office whether arising from infirmity of body or mind, or any other cause, or for misbehaviour and shall not be removed except in accordance with subsections (12) to (14).",
        "(12) A member of the Public Bodies Appeal Tribunal shall be removed from office by the President where the question of his removal from that office has been referred to a tribunal appointed under subsection (13) and the tribunal has recommended to the President that he ought to be removed from office for inability to discharge the functions of his office or for misbehaviour.",
        "(13) Where the President, acting in his own deliberate judgment, considers that the question of removing a member of the Public Bodies Appeal Tribunal ought to be investigated— (a) the President, acting in his own deliberate judgment, shall appoint a tribunal which shall consist of a Chairperson and not less than 2 other members, being persons who hold or have held office as a Judge of a Court having unlimited jurisdiction in civil and criminal matters in some part of the Commonwealth or of a Court having jurisdiction in appeals from such a Court; and (b) that tribunal shall enquire into the matter and report on the facts to the President and recommend to the President whether the member of the Public Bodies Appeal Tribunal ought to be removed under this section.",
        "(14) Where the question of removing a member has been referred to a tribunal under subsection (13), the President, acting in his own deliberate judgment, may suspend the member from performing the functions of his office and any such suspension may at any time be revoked by the President, acting in his own deliberate judgment, and shall in any case cease to have effect where the tribunal recommends to the President that the member should not be removed.",
        "(15) The offices of the staff of the Public Bodies Appeal Tribunal shall be public offices.",
        "(16) There shall be such provision as may be prescribed for such supplementary or ancillary matters as may appear necessary or expedient in consequence of any of the provisions of this section."
    ]


}