{
    "31. Parliament of Mauritius":["(1) There shall be a Parliament for Mauritius, which shall consist of the President and a National Assembly.",
    "(2) The Assembly shall consist of persons elected in accordance with the First Schedule, which makes provision for the election of 70 members. ",
    "=[S. 31 amended by Act 48 of 1991.]"],

    "32. Speaker and Deputy Speaker": [
        "(1)(a) The Assembly shall, at its first sitting after any general election, on motion supported by the votes of a majority of all the members of the Assembly elect—",
        "~(i) from among its members or otherwise, a Speaker;",
        "~(ii) from among its members, a Deputy Speaker.",
            "(b) A motion under paragraph (a) shall not be the subject matter of a debate in the Assembly.",
        "(2) A person who is a Minister shall not be qualified for election as Speaker or Deputy Speaker.",
        "(3) The office of the Speaker or the Deputy Speaker shall become vacant—",
            "~(a) where—",
                "~~(i) the Speaker, in the case of a Speaker who is a member of the Assembly; or",
                "~~(ii) the Deputy Speaker,",
        "ceases to be a member of the Assembly otherwise than by reason of the dissolution of the Assembly;",
        "~(b) where he—",
        "~~(i) is convicted of a criminal offence punishable by imprisonment by a Court in any part of the Commonwealth;",
        "~~(ii) is adjudged or otherwise declared bankrupt in any part of the Commonwealth; or",
        "~~(iii) is adjudged to be of unsound mind or is detained as a criminal lunatic under any law in force in Mauritius; and",
        "the Assembly passes a resolution supported by the votes of a majority of all the members requiring his removal from office;",
        "~(c) where he becomes a Minister;",
        "~(d) where the Assembly passes a resolution supported by the votes of two thirds of all the members requiring his removal from office;",
        "~(e) where the Assembly first sits after any general election;",
        "~(f) in the case of the Deputy Speaker, when the Assembly first sits after being prorogued;",
        "~(g) in the case of a Speaker who is not a member of the Assembly, where, without leave of the President previously being obtained, he is absent from the sittings of the Assembly for a continuous period of 3 months during any session for any reason other than his being in lawful custody in Mauritius;",
        "~(h) where he becomes a party to any contract with the Government for or on account of the public service, or where any firm in which he is a partner or any company of which he is a director or manager becomes a party to any such contract, or where he becomes a partner in a firm or a director or manager of a company which is a party to any such contract, or where he becomes a trustee, manager or, with his consent, a beneficiary of a trust which is a party to any such contract.",
        "(4) Where the office of the Speaker or the Deputy Speaker becomes vacant at any time, the Assembly, in the manner specified in subsection (1), shall, unless it is sooner dissolved, elect—",
        "~(a) from among its members or otherwise, a Speaker;",
        "~(b) from among its members, a Deputy Speaker.",
        "(4A) No person shall be eligible for election as Speaker unless he is a citizen of Mauritius.",
        "(4B) A person elected as Speaker shall not, whilst in office—",
        "~(a) hold any other office of emolument, whether under the Constitution or otherwise;",
        "~(b) exercise any profession or calling.",
        "(5) A person holding the office of Speaker or Deputy Speaker may resign his office by writing under his hand addressed to the Assembly and the office shall become vacant when the writing is received by the Clerk to the Assembly.",
        "(6) No business shall be transacted in the Assembly (other than the election of a Speaker) at any time when the office of Speaker is vacant.",
        "(7) Where a motion is presented for the purposes of subsection (3) (b) or (d), the Speaker or the Deputy Speaker, as the case may be, shall not preside over the proceedings of the Assembly at that sitting.",
        "(8) (a) Notwithstanding any pending judicial proceedings by or against the Speaker or the Deputy Speaker or any thing contained in the Standing Orders of the Assembly, where a motion is presented to the Speaker by the Prime Minister for the purposes of subsection (3) (b) or (d), the motion shall—",
        "~~(i) be required to specify the ground for such removal;",
        "~~(ii) form part of the business of the Assembly when it first sits after presentation of the motion;",
        "~~(iii) have priority over all other business of the Assembly;",
        "~~(iv) be the subject matter of a debate in the Assembly;",
        "~~(v) be put to the vote of members at that sitting.",
        "(b) Where a motion presented by the Prime Minister for the purposes of subsection (3) (b) or (d) does not form part of the business of the Assembly as provided under paragraph (a) (ii), the Prime Minister may, before the commencement of the business at the sitting, table the text of the motion in the Assembly, and the motion shall thereupon be dealt with in accordance with this subsection.",
        "=[S. 32 amended by Act 2 of 1982; Act 36 of 1990; Act 1 of 1996.]"
    ],

    "33. Qualifications for membership": [
        "Subject to section 34, a person shall be qualified to be elected as a member of the Assembly if, and shall not be so qualified unless, he—",
        "~(a) is a Commonwealth citizen of not less than the age of 18 years;",
        "~(b) has resided in Mauritius for a period of, or periods amounting in the aggregate to, not less than 2 years before the date of his nomination for election;",
        "~(c) has resided in Mauritius for a period of not less than 6 months immediately before that date; and",
        "~(d) is able to speak and, unless incapacitated by blindness or other physical cause, to read the English language with a degree of proficiency sufficient to enable him to take an active part in the proceedings of the Assembly."
    ],

    "34. Disqualifications for membership": [
        "(1) No person shall be qualified to be elected as a member of the Assembly who—",
        "~(a) is, by virtue of his own act, under any acknowledgement of allegiance, obedience or adherence to a power or State outside the Commonwealth;",
        "~(b) is a public officer or a local government officer;",
        "~(c) is a party to, or a partner in a firm or a director or manager of a company which is a party to, any contract with the Government for or on account of the public service, and has not, within 14 days after his nomination as a candidate for election, published in the English language in the Gazette and in a newspaper circulating in the constituency for which he is a candidate, a notice setting out the nature of such contract and his interest, or the interest of any such firm or company, therein;",
        "~(d) has been adjudged or otherwise declared bankrupt under any law in force in any part of the Commonwealth and has not been discharged or has obtained the benefit of a cessio bonorum in Mauritius;",
        "~(e) is a person adjudged to be of unsound mind or detained as a criminal lunatic under any law in force in Mauritius;",
        "~(f) is under sentence of death imposed on him by a Court in any part of the Commonwealth, or is serving a sentence of imprisonment (by whatever name called) exceeding 12 months imposed on him by such a Court or substituted by competent authority for some other sentence imposed on him by such a Court, or is under such a sentence of imprisonment the execution of which has been suspended;",
        "~(g) is disqualified for election by any law in force in Mauritius by reason of his holding, or acting in, an office the functions of which involve—",
        "~~(i) any responsibility for, or in connection with, the conduct of any election; or",
        "~~(ii) any responsibility for the compilation or revision of any electoral register; or",
        "~(h) is disqualified for membership of the Assembly by any law in force in Mauritius relating to offences connected with elections.",
        "(2) Where it is prescribed by Parliament that any office in the public service or the service of a local authority is not to be regarded as such an office for the purposes of this section, a person shall not be regarded for the purposes of this section as a public officer or a local government officer, as the case may be, by reason only that he holds, or is acting in, that office.",
        "(3) For the purpose of this section—",
        "~(a) 2 or more terms of imprisonment that are required to be served consecutively shall be regarded as a single term of imprisonment for the aggregate period of those terms; and",
        "~(b) imprisonment in default of payment of a fine shall be disregarded."
    ],

    "35. Tenure of office of members": [
        "(1) The seat in the Assembly of a member shall become vacant—",
        "~(a) upon a dissolution of Parliament;",
        "~(b) where he ceases to be a Commonwealth citizen;",
        "~(c) where he becomes a party to any contract with Government for or on account of the public service, or where any firm in which he is a partner or any company of which he is a director or manager becomes a party to any such contract, or where he becomes a partner in a firm or a director or manager of a company which is a party to any such contract:",
        "~~Provided that, where in the circumstances it appears to him to be just to do so, the Speaker (or, where the office of Speaker is vacant or he is for any reason unable to perform the functions of his office, the Deputy Speaker) may exempt any member from vacating his seat under this paragraph where such member, before becoming a party to such contract, or before or as soon as practicable after becoming otherwise interested in such contract (whether as a partner in a firm or as a director or manager of a company), discloses to the Speaker or, as the case may be, the Deputy Speaker the nature of such contract and his interest or the interest of any such firm or company therein;",
        "~(d) where he ceases to be resident in Mauritius;",
        "~(e) where, without leave of the Speaker (or, where the office of Speaker is vacant or he is for any reason unable to perform the functions of his office, the Deputy Speaker) previously obtained, he is absent from the sittings of the Assembly for a continuous period of 3 months during any session for any reason other than his being in lawful custody in Mauritius;",
        "~(f) where any of the circumstances arise that, if he were not a member of the Assembly, would cause him to be disqualified for election thereto by virtue of section 34 (1) (a), (b), (d), (e), (g) or (h);",
        "~(g) in the circumstances mentioned in section 36.",
        "(2) A member of the Assembly may resign his seat by writing under his hand addressed to the Speaker and the seat shall become vacant when the writing is received by the Speaker or, if the office of Speaker is vacant or the Speaker is for any reason unable to perform the functions of his office, by the Deputy Speaker or such other person as may be specified in the rules and orders of the Assembly.",
        "(3) Where the seat in the Assembly of a member who represents a constituency becomes vacant otherwise than by reason of a dissolution of Parliament, the writ for an election to fill the vacancy shall, unless Parliament is sooner dissolved, be issued within 90 days of the occurrence of the vacancy.",
        "=[S. 35 amended by Act 2 of 1982.]"
    ],

    "36. Vacation of seat on sentence": [
        "(1) Subject to this section, where a member of the Assembly is sentenced by a Court in any part of the Commonwealth to death or to imprisonment (by whatever name called) for a term exceeding 12 months, he shall forthwith cease to perform his functions as a member of the Assembly and his seat in the Assembly shall become vacant at the expiration of a period of 30 days thereafter:",
        "~~Provided that the Speaker (or, where the office of Speaker is vacant or he is for any reason unable to perform the functions of his office, the Deputy Speaker) may, at the request of the member, from time to time extend that period of 30 days to enable the member to pursue any appeal in respect of his conviction or sentence, so however that extensions of time exceeding in the aggregate 330 days shall not be given without the approval of the Assembly signified by resolution.",
        "(2) Where at any time before the member vacates his seat, he is granted a free pardon or his conviction is set aside or his sentence is reduced to a term of imprisonment of less than 12 months or a punishment other than imprisonment is substituted, his seat in the Assembly shall not become vacant under subsection (1) and he may again perform his functions as a member of the Assembly.",
        "(3) For the purpose of this section—",
        "~~(a) 2 or more terms of imprisonment that are required to be served consecutively shall be regarded as a single term of imprisonment for the aggregate period of those terms; and",
        "~~(b) imprisonment in default of payment of a fine shall be disregarded."
    ],

    "36A. Validity of previous elections": [
        "Notwithstanding any provision of this Constitution relating to the election of members of the Assembly or to their tenure of office as members of the Assembly, where, in relation to any general election held between 1 January 1967 and 30 September 1991, any person has committed an offence against an electoral law by reason of any act or omission in relation to the printing, publishing or posting of any bill, placard or poster, that act or omission shall not be held to—",
        "~~(a) have affected or to affect the validity of the election of that person to the Assembly or of anything done by the Assembly or that member;",
        "~~(b) have disqualified or to disqualify that person from membership of the Assembly.",
        "=[S. 36A inserted by Act 16 of 1992.]"
    ],

    "37. Determination of questions as to membership": [
        "(1) The Supreme Court shall have jurisdiction to hear and determine any question whether—",
        "~~(a) any person has been validly elected as a member of the Assembly;",
        "~~(b) any person who has been elected as Speaker or Deputy Speaker was qualified to be so elected or has vacated the office of Speaker or Deputy Speaker, as the case may be; or",
        "~~(c) any member of the Assembly has vacated his seat or is required, under section 36, to cease to perform his functions as a member of the Assembly.",
        "(2) An application to the Supreme Court for the determination of any question under subsection (1) (a) may be made by any person entitled to vote in the election to which the application relates or by any person who was a candidate at that election or by the Attorney-General and, where it is made by a person other than the Attorney-General, the Attorney-General may intervene and may then appear or be represented in the proceedings.",
        "(3) An application to the Supreme Court for the determination of any question under subsection (1) (b) may be made by any member of the Assembly or by the Attorney-General, and, where it is made by a person other than the Attorney-General, the Attorney-General may intervene and may then appear or be represented in the proceedings.",
        "(4) An application to the Supreme Court for the determination of any question under subsection (1) (c) may be made—",
        "~~(a) by any member of the Assembly or by the Attorney-General; or",
        "~~(b) by any person registered in some constituency as an elector,",
        "and, where it is made by a person other than the Attorney-General, the Attorney-General may intervene and may then appear or be represented in the proceedings.",
        "(5) Parliament may make provision with respect to—",
        "~~(a) the circumstances and manner in which and the imposition of conditions upon which any application may be made to the Supreme Court for the determination of any question under this section; and",
        "~~(b) the powers, practice and procedure of the Supreme Court in relation to any such application.",
        "(6) A determination by the Supreme Court in proceedings under this section shall not be subject to an appeal:",
        "~~Provided that an appeal shall lie to the Judicial Committee in such cases as may be prescribed by Parliament.",
        "(7) In the exercise of his functions under this section, the Attorney-General shall not be subject to the direction or control of any other person or authority.",
        "=[S. 37 amended by Act 48 of 1991.]"
    ],

    "38. Electoral Commissions": [
        "(1) There shall be an Electoral Boundaries Commission which shall consist of a Chairperson and not less than 2 nor more than 7 other members appointed by the President, acting after consultation with the Prime Minister, the Leader of the Opposition and such other persons as appear to the President, acting in his own deliberate judgment, to be leaders of parties in the Assembly.",
        "(2) There shall be an Electoral Supervisory Commission which shall consist of a Chairperson and not less than 2 nor more than 7 other members appointed by the President, acting after consultation with the Prime Minister, the Leader of the Opposition and such other persons as appear to the President, acting in his own deliberate judgment, to be leaders of parties in the Assembly.",
        "(3) No person shall be qualified for appointment as a member of the Electoral Boundaries Commission or the Electoral Supervisory Commission if he is a member of, or a candidate for election to, the Assembly or any local authority or a public officer or a local government officer.",
        "(4) Subject to this section, a member of the Electoral Boundaries Commission or the Electoral Supervisory Commission shall vacate his office—",
        "~~(a) at the expiration of 5 years from the date of his appointment; or",
        "~~(b) where any circumstances arise that, if he were not a member of the Commission, would cause him to be disqualified for appointment as such.",
        "(5) The provisions of section 92 (2) to (5) shall apply to a member of the Electoral Boundaries Commission or the Electoral Supervisory Commission as they apply to a Commissioner within the meaning of section 92.",
        "=[S. 38 amended by Act 48 of 1991; s. 3 of Act 28 of 2003 w.e.f. 15 September 2003.]"
    ],

    "39. Constituencies": [
        "(1) There shall be 21 constituencies and accordingly—",
        "~~(a) the Island of Mauritius shall be divided into 20 constituencies;",
        "~~(b) Rodrigues shall form one constituency:",
        "Provided that the Assembly may by resolution provide that any island forming part of Mauritius that is not comprised in the Island of Mauritius or Rodrigues shall be included in such one of the constituencies as the Electoral Boundaries Commission may determine and with effect from the next dissolution of Parliament after the passing of any such resolution, this section shall have effect accordingly.",
        "(2) The Electoral Boundaries Commission shall review the boundaries of the constituencies at such times as will enable them to present a report to the Assembly 10 years, as near as may be, after 12 August 1966 and, thereafter, 10 years after presentation of their last report:",
        "Provided that the Commission may at any time carry out a review and present a report if it considers it desirable to do so by reason of the holding of an official census of the population of Mauritius and shall do so if a resolution is passed by the Assembly in pursuance of subsection (1).",
        "(3) The report of the Electoral Boundaries Commission shall make recommendations for any alterations to the boundaries of the constituencies as appear to the Commission to be required so that the number of inhabitants of each constituency is as nearly equal as is reasonably practicable to the population quota:",
        "Provided that the number of inhabitants of a constituency may be greater or less than the population quota in order to take account of means of communication, geographical features, density of population and the boundaries of administrative areas.",
        "(4) The Assembly may, by resolution, approve or reject the recommendations of the Electoral Boundaries Commission but may not vary them; and, if so approved, the recommendations shall have effect as from the next dissolution of Parliament.",
        "(5) In this section, “population quota” means the number obtained by dividing the number of inhabitants of the Island of Mauritius (including any island included in any constituency in the Island of Mauritius by virtue of any resolution under subsection (1)) according to the latest official census of the population of Mauritius by 20."
    ],

    "40. Electoral Commissioner": [
        "(1) There shall be an Electoral Commissioner, whose office shall be a public office and who shall be appointed by the Judicial and Legal Service Commission.",
        "(2) No person shall be qualified to hold or act in the office of Electoral Commissioner unless he is qualified to practise as a barrister in Mauritius.",
        "(3) Without prejudice to section 41, in the exercise of his functions under this Constitution, the Electoral Commissioner shall not be subject to the direction or control of any other person or authority."
    ],

    "41. Functions of Electoral Supervisory Commission and Electoral Commissioner": [
        "(1) The Electoral Supervisory Commission shall have general responsibility for, and shall supervise, the registration of electors for the election of members of the Assembly and the conduct of elections of such members and the Commission shall have such powers and other functions relating to such registration and such elections as may be prescribed.",
        "(2) The Electoral Commissioner shall have such powers and other functions relating to such registration and elections as may be prescribed, and he shall keep the Electoral Supervisory Commission fully informed concerning the exercise of his functions and shall have the right to attend meetings of the Commission and to refer to the Commission for their advice or decision any question relating to his functions.",
        "(3) Every proposed Bill and every proposed regulation or other instrument having the force of law relating to the registration of electors for the election of members of the Assembly or to the election of such members shall be referred to the Electoral Supervisory Commission and to the Electoral Commissioner at such time as shall give them sufficient opportunity to make comments thereon before the Bill is introduced in the Assembly or, as the case may be, the regulation or other instrument is made.",
        "(4) The Electoral Supervisory Commission may make such reports to the President concerning the matters under their supervision, or any draft Bill or instrument that is referred to them, as they may think fit and if the Commission so requests in any such report, other than a report on a draft Bill or instrument, that report shall be laid before the Assembly.",
        "(5) The question whether the Electoral Commissioner has acted in accordance with the advice of or a decision of the Electoral Supervisory Commission shall not be enquired into in any Court of law.",
        "[S. 41 amended by Act 48 of 1991.]"
    ],

    "42. Qualifications of electors": [
        "(1) Subject to section 43, a person shall be entitled to be registered as an elector if, and shall not be so entitled unless—",
        "~(a) he is a Commonwealth citizen of not less than the age of 18 years; and",
        "~(b) either he has resided in Mauritius for a period of not less than 2 years immediately before such date as may be prescribed by Parliament or he is domiciled in Mauritius and is resident there on the prescribed date.",
        "(2) No person shall be entitled to be registered as an elector—",
        "~(a) in more than one constituency; or",
        "~(b) in any constituency in which he is not resident on the prescribed date."
    ],

    "43. Disqualifications of electors": [
        "No person shall be entitled to be registered as an elector who—",
        "~(a) is under sentence of death imposed on him by a Court in any part of the Commonwealth, or is serving a sentence of imprisonment (by whatever name called) exceeding 12 months imposed on him by such a Court or substituted by competent authority for some other sentence imposed on him by such a Court, or is under such a sentence of imprisonment the execution of which has been suspended;",
        "~(b) is a person adjudged to be of unsound mind or detained as a criminal lunatic under any law in force in Mauritius; or",
        "~(c) is disqualified for registration as an elector by any law in force in Mauritius relating to offences connected with elections."
    ],

    "44. Right to vote at elections": [
        "(1) Any person who is registered as an elector in a constituency shall be entitled to vote in such manner as may be prescribed at any election for that constituency unless he is prohibited from so voting by any law in force in Mauritius because—",
        "~(a) he is a returning officer; or",
        "~(b) he has been concerned in any offence connected with elections:",
        "Provided that no such person shall be entitled so to vote if on the date prescribed for polling he is in lawful custody or (except in so far as may otherwise be prescribed) he is for any other reason unable to attend in person at the place and time prescribed for polling.",
        "(2) No person shall vote at any election for any constituency who is not registered as an elector in that constituency."
    ]
}